Ran Plan for 4 projects:

1. project: `frontend_amer_autoscale` dir: `frontend/gcp_autoscale` workspace: `amer`
1. project: `frontend_asia_autoscale` dir: `frontend/gcp_autoscale` workspace: `asia`
1. project: `frontend_ocea_autoscale` dir: `frontend/gcp_autoscale` workspace: `ocea`
1. project: `frontend_euro_autoscale` dir: `frontend/gcp_autoscale` workspace: `euro`

### 1. project: `frontend_amer_autoscale` dir: `frontend/gcp_autoscale` workspace: `amer`
<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_autoscaler.asg[0] will be updated in-place
~ resource "google_compute_autoscaler" "asg" {
        creation_timestamp = "2020-09-22T15:45:03.515-07:00"
        id                 = "projects/2036174436/zones/us-west4-b/autoscalers/asg-amer-us-west4"
        name               = "asg-amer-us-west4"
        project            = "2036174436"
        self_link          = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/us-west4-b/autoscalers/asg-amer-us-west4"
      ~ target             = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/us-west4-b/instanceGroupManagers/asg-group-manager-amer-us-west4" -> "projects/2036174436/zones/us-west4-b/instanceGroupManagers/asg-group-manager-amer-us-west4"
        zone               = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/us-west4-b"

        autoscaling_policy {
            cooldown_period = 60
            max_replicas    = 2
            min_replicas    = 2
            mode            = "ON"

            cpu_utilization {
                target = 0.5
            }
        }
    }

  # google_compute_autoscaler.asg[1] will be updated in-place
~ resource "google_compute_autoscaler" "asg" {
        creation_timestamp = "2020-09-22T15:45:03.544-07:00"
        id                 = "projects/2036174436/zones/us-east4-b/autoscalers/asg-amer-us-east4"
        name               = "asg-amer-us-east4"
        project            = "2036174436"
        self_link          = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/us-east4-b/autoscalers/asg-amer-us-east4"
      ~ target             = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/us-east4-b/instanceGroupManagers/asg-group-manager-amer-us-east4" -> "projects/2036174436/zones/us-east4-b/instanceGroupManagers/asg-group-manager-amer-us-east4"
        zone               = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/us-east4-b"

        autoscaling_policy {
            cooldown_period = 60
            max_replicas    = 2
            min_replicas    = 2
            mode            = "ON"

            cpu_utilization {
                target = 0.5
            }
        }
    }

  # google_compute_forwarding_rule.asg[0] must be replaced
-/+ resource "google_compute_forwarding_rule" "asg" {
      - all_ports             = false -> null
      - allow_global_access   = false -> null
      ~ creation_timestamp    = "2020-09-22T16:04:04.034-07:00" -> (known after apply)
      ~ id                    = "projects/2036174436/regions/us-west4/forwardingRules/asg-forwarding-rule-us-west4" -> (known after apply)
        ip_address            = "34.125.0.57"
      ~ ip_protocol           = "TCP" -> (known after apply)
      + ip_version            = (known after apply)
        load_balancing_scheme = "EXTERNAL"
        name                  = "asg-forwarding-rule-us-west4"
      + network               = (known after apply)
      ~ network_tier          = "PREMIUM" -> (known after apply)
      ~ port_range            = "80-80" -> "443" # forces replacement
      - ports                 = [] -> null
      ~ project               = "2036174436" -> (known after apply)
        region                = "us-west4"
      ~ self_link             = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/regions/us-west4/forwardingRules/asg-forwarding-rule-us-west4" -> (known after apply)
      + service_name          = (known after apply)
      + subnetwork            = (known after apply)
        target                = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/regions/us-west4/targetPools/asg-target-pool-us-west4"
    }

  # google_compute_forwarding_rule.asg[1] must be replaced
-/+ resource "google_compute_forwarding_rule" "asg" {
      - all_ports             = false -> null
      - allow_global_access   = false -> null
      ~ creation_timestamp    = "2020-09-22T16:04:03.731-07:00" -> (known after apply)
      ~ id                    = "projects/2036174436/regions/us-east4/forwardingRules/asg-forwarding-rule-us-east4" -> (known after apply)
        ip_address            = "34.86.167.251"
      ~ ip_protocol           = "TCP" -> (known after apply)
      + ip_version            = (known after apply)
        load_balancing_scheme = "EXTERNAL"
        name                  = "asg-forwarding-rule-us-east4"
      + network               = (known after apply)
      ~ network_tier          = "PREMIUM" -> (known after apply)
      ~ port_range            = "80-80" -> "443" # forces replacement
      - ports                 = [] -> null
      ~ project               = "2036174436" -> (known after apply)
        region                = "us-east4"
      ~ self_link             = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/regions/us-east4/forwardingRules/asg-forwarding-rule-us-east4" -> (known after apply)
      + service_name          = (known after apply)
      + subnetwork            = (known after apply)
        target                = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/regions/us-east4/targetPools/asg-target-pool-us-east4"
    }

Plan: 2 to add, 2 to change, 2 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p frontend_amer_autoscale`
* :put_litter_in_its_place: To **delete** this plan click [here](http://b2087ccfd9f7:4141/lock?id=dmalicia%252Fdm-terraform%252Ffrontend%252Fgcp_autoscale%252Famer)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p frontend_amer_autoscale`
</details>

---
### 2. project: `frontend_asia_autoscale` dir: `frontend/gcp_autoscale` workspace: `asia`
```diff

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p frontend_asia_autoscale`
* :put_litter_in_its_place: To **delete** this plan click [here](http://b2087ccfd9f7:4141/lock?id=dmalicia%252Fdm-terraform%252Ffrontend%252Fgcp_autoscale%252Fasia)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p frontend_asia_autoscale`

---
### 3. project: `frontend_ocea_autoscale` dir: `frontend/gcp_autoscale` workspace: `ocea`
```diff

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p frontend_ocea_autoscale`
* :put_litter_in_its_place: To **delete** this plan click [here](http://b2087ccfd9f7:4141/lock?id=dmalicia%252Fdm-terraform%252Ffrontend%252Fgcp_autoscale%252Focea)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p frontend_ocea_autoscale`

---
### 4. project: `frontend_euro_autoscale` dir: `frontend/gcp_autoscale` workspace: `euro`
```diff

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p frontend_euro_autoscale`
* :put_litter_in_its_place: To **delete** this plan click [here](http://b2087ccfd9f7:4141/lock?id=dmalicia%252Fdm-terraform%252Ffrontend%252Fgcp_autoscale%252Feuro)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p frontend_euro_autoscale`

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
